Tekla Open API Reference for Tekla Structures 2025
CastUnitDrawing.CastUnitIdentifier Property
 The identifier of the model object cast unit.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Identifier CastUnitIdentifier { get; }
Public ReadOnly Property CastUnitIdentifier As Identifier
	Get
Property Value
Type: Identifier
See Also
Reference
CastUnitDrawing Class
Tekla.Structures.Drawing Namespace